<?xml version="1.0"?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_4" type="Parameter" version="opset1">
			<data shape="1,224,299,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_4,input_4:0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>299</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_4/Transpose([0 3 1 2])/value2254628093" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_4/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>299</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/feature_extractor/tf.math.truediv_1/truediv/y" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="32" size="4" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/tf.math.truediv_1/truediv/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/feature_extractor/tf.math.truediv_1/truediv" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/tf.math.truediv_1/truediv:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/feature_extractor/tf.math.subtract_1/Sub/y" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="36" size="4" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/tf.math.subtract_1/Sub/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/feature_extractor/tf.math.subtract_1/Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/tf.math.subtract_1/Sub:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_94/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="40" size="3456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_94/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_94/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>299</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_17700" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3496" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_94/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_94/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_94/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_94/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_95/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="3624" size="36864" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_95/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_95/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>111</dim>
					<dim>149</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_1770317708" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="40488" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_95/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_95/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_95/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_95/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_96/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="40616" size="73728" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_96/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_96/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1771117716" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="114344" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_96/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_96/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_96/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_96/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/feature_extractor/inception_v3/max_pooling2d_4/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>109</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/max_pooling2d_4/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_97/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="80, 64, 1, 1" offset="114600" size="20480" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_97/Conv2D/ReadVariableOp:0">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_97/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_1771917724" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1, 1" offset="135080" size="320" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_97/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_97/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_97/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_97/Relu:0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_98/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 80, 3, 3" offset="135400" size="552960" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_98/Conv2D/ReadVariableOp:0">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_98/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>54</dim>
					<dim>73</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_1772717732" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="688360" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_98/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_98/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_98/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_98/Relu:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/feature_extractor/inception_v3/max_pooling2d_5/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>52</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/max_pooling2d_5/MaxPool:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_99/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 192, 1, 1" offset="689128" size="49152" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_99/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_99/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_1778317788" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="738280" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_99/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_99/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_99/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_99/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_100/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 192, 1, 1" offset="738536" size="36864" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_100/Conv2D/ReadVariableOp:0">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_100/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_1776717772" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="775400" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_100/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_100/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_100/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_100/Relu:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_101/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 5, 5" offset="775592" size="307200" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_101/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_101/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_1777517780" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1082792" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_101/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_101/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_101/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_101/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_102/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 192, 1, 1" offset="1083048" size="49152" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_102/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_102/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_1774317748" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1132200" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_102/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_102/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_102/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_102/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_103/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 64, 3, 3" offset="1132456" size="221184" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_103/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_103/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_1775117756" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1353640" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_103/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_103/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_103/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_103/Relu:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_104/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="1354024" size="331776" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_104/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_104/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_1775917764" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1685800" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_104/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_104/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_104/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_104/Relu:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/feature_extractor/inception_v3/average_pooling2d_9/AvgPool" type="AvgPool" version="opset1">
			<data kernel="3, 3" strides="1, 1" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="same_upper" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/average_pooling2d_9/AvgPool:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_105/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="1686184" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_105/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_105/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_1773517740" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1710760" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_105/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_105/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_105/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_105/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/feature_extractor/inception_v3/mixed0/concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/mixed0/concat:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_106/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="1710888" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_106/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_106/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="data_add_1783917844" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1776424" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_106/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_106/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_106/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_106/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_107/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 256, 1, 1" offset="1776680" size="49152" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_107/Conv2D/ReadVariableOp:0">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_107/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="data_add_1782317828" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="1825832" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_107/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_107/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_107/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_107/Relu:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_108/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 5, 5" offset="1826024" size="307200" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_108/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_108/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_1783117836" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2133224" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_108/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_108/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_108/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/activation_108/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_109/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="2133480" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_109/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/feature_extractor/inception_v3/conv2d_109/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_add_1779917804" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2199016" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_109/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/feature_extractor/inception_v3/batch_normalization_109/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/feature_extractor/inception_v3/activation_109/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
